In [1]:
import pandas as pd

In [2]:
test_1 = pd.read_csv(r'C:\Users\Dell\.ipynb_checkpoints\file2.txt')
test_1

   emp_id emp_name age department  joining_day  joining_month
0       1     aqsa  25         AI            9              4
1       2   fatima  20          -            8             19
2       3     zara  18          -            9              6
3       4    samra   *        NaN            4              4

In [6]:
df = pd.DataFrame(test_1)

In [7]:
df

   emp_id emp_name age department  joining_day  joining_month
0       1     aqsa  25         AI            9              4
1       2   fatima  20          -            8             19
2       3     zara  18          -            9              6
3       4    samra   *        NaN            4              4

In [8]:
df.isnull()

   emp_id  emp_name    age  department  joining_day  joining_month
0   False     False  False       False        False          False
1   False     False  False       False        False          False
2   False     False  False       False        False          False
3   False     False  False        True        False          False

In [9]:
#missing values ko hm fill kare ge koi value rakh kar

In [10]:
#is null opposite jo hai not null
df.notnull()

   emp_id  emp_name   age  department  joining_day  joining_month
0    True      True  True        True         True           True
1    True      True  True        True         True           True
2    True      True  True        True         True           True
3    True      True  True       False         True           True

In [11]:
#missing row delete
complete_data = df.dropna()

In [13]:
complete_data

   emp_id emp_name age department  joining_day  joining_month
0       1     aqsa  25         AI            9              4
1       2   fatima  20          -            8             19
2       3     zara  18          -            9              6

In [28]:
test_1 = pd.read_csv(r'C:\Users\Dell\.ipynb_checkpoints\file4.txt')
test_1

     name   age course timming            Degree
0   Hafsa  18.0     AI    9:12  Computer science
1  Areeba  20.0    CBN   10:11               NaN
2   Hadia   NaN     AI    9:12               Bio
3     NaN   NaN    NaN     NaN               NaN

In [29]:
df1 = pd.DataFrame(test_1)

In [30]:
df1

     name   age course timming            Degree
0   Hafsa  18.0     AI    9:12  Computer science
1  Areeba  20.0    CBN   10:11               NaN
2   Hadia   NaN     AI    9:12               Bio
3     NaN   NaN    NaN     NaN               NaN

In [31]:
df1.isnull()

    name    age  course  timming  Degree
0  False  False   False    False   False
1  False  False   False    False    True
2  False   True   False    False   False
3   True   True    True     True    True

In [32]:
df1.notnull()

    name    age  course  timming  Degree
0   True   True    True     True    True
1   True   True    True     True   False
2   True  False    True     True    True
3  False  False   False    False   False

In [37]:
complete_data = df1.dropna()

In [38]:
complete_data

    name   age course timming            Degree
0  Hafsa  18.0     AI    9:12  Computer science

In [35]:
#Whole line delete those all values of rows is NAN
complete_data = df1.dropna(how = 'all')

In [36]:
complete_data

     name   age course timming            Degree
0   Hafsa  18.0     AI    9:12  Computer science
1  Areeba  20.0    CBN   10:11               NaN
2   Hadia   NaN     AI    9:12               Bio

In [60]:
#axis 1 mean Nan column remove
data = df1.dropna(axis = 1)

In [61]:
data

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [ ]:
#iloc through indexing integer base position de rha hai
#loc acess through label

In [62]:
#thresh menas itni cell mai values moojod hain to rehne do us mai

In [75]:
data1 = df1.dropna(thresh=5)

In [76]:
data1

    name   age course timming            Degree
0  Hafsa  18.0     AI    9:12  Computer science

In [78]:
#filled missing value
filled_df = df1.fillna(0)

In [79]:
filled_df

     name   age course timming            Degree
0   Hafsa  18.0     AI    9:12  Computer science
1  Areeba  20.0    CBN   10:11                 0
2   Hadia   0.0     AI    9:12               Bio
3       0   0.0      0       0                 0

In [116]:
filled_df = df1.fillna({'course':'un-known','name':'John doe','Degree':'NA','timming':'11:12','age': '20'})

In [118]:
filled_df

       name age    course timming            Degree
0     Hafsa  18        AI    9:12  Computer science
1    Areeba  20       CBN   10:11                NA
2     Hadia  20        AI    9:12               Bio
3  John doe  20  un-known   11:12                NA

In [103]:
#out of place to return new data frame

In [104]:
filled_df = df1.fillna({'course':'un-known','name':'John doe','Degree':'NA','timming':'11:12','age':'20'})
print(df1)
print(filled_df )

       name age    course timming            Degree
0     Hafsa  18        AI    9:12  Computer science
1    Areeba  20       CBN   10:11                NA
2     Hadia  20        AI    9:12               Bio
3  John doe  20  un-known   11:12                NA
       name age    course timming            Degree
0     Hafsa  18        AI    9:12  Computer science
1    Areeba  20       CBN   10:11                NA
2     Hadia  20        AI    9:12               Bio
3  John doe  20  un-known   11:12                NA

In [105]:
#without variable define
df1.fillna({'course':'un-known','name':'John doe','Degree':'NA','timming':'11:12','age':'20'},inplace = True)

In [106]:
df1

       name age    course timming            Degree
0     Hafsa  18        AI    9:12  Computer science
1    Areeba  20       CBN   10:11                NA
2     Hadia  20        AI    9:12               Bio
3  John doe  20  un-known   11:12                NA

In [119]:
#Missing value fill with backword filling and forward filling
filled_df = df1.fillna(method = 'bfill')
filled_df = filled_df.loc[0:3].fillna(method = 'ffill')
#print(df1)
print(filled_df )

       name age    course timming            Degree
0     Hafsa  18        AI    9:12  Computer science
1    Areeba  20       CBN   10:11                NA
2     Hadia  20        AI    9:12               Bio
3  John doe  20  un-known   11:12                NA

# Data Transformation

Removing Duplicates

In [120]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'], 'k2': [1, 1, 2, 3, 3, 4, 4]})

In [121]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [123]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [126]:
uniue_records = data.drop_duplicates()

In [128]:
print(uniue_records)
print(data)

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [130]:
uniue_records = data.drop_duplicates(['k1', 'k2'], keep='last')

In [131]:
uniue_records

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
6  two   4

In [133]:
#map kia karta hai ek agrument le or transform value ko return karde

In [134]:
data1 = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 'Pastrami', 'corned beef', 'Bacon','pastrami', 'honey ham', 'nova lox'],'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [135]:
#hr cell ke liye ek new value return hogi
lowercased = data1['food'].str.lower()

In [139]:
print(lowercased.shape)
print(data['food'].shape)

(9,)

KeyError: 'food'

In [140]:
#map wo ek function programming paradigim mai lega or ek arrya ke upper call hoga or tranform kar ke send kare ga or shape wohi rehe gi

In [141]:
data1 = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 'Pastrami', 'corned beef', 'Bacon','pastrami', 'honey ham', 'nova lox'],'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [142]:
#continue karna hai

In [ ]:
#replace means inappropriate function jo hme nhi chahiye the waha NAN

In [146]:
import numpy as np
data.replace([-999, -1000], np.nan)

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [147]:
#index

# Discretization and Binning

In [ ]:
#dicretization means uper se niche(jin ki do possible values ke darmyan finites number hun not continous)

In [ ]:
import numpy as np

In [3]:
x = [50,53,54,25,16,18,34,90,40,22]

In [10]:
#beans must me uniformely incremental (increase must be monotonically)
bins = [20,40,60,80,100]

In [11]:
y = pd.cut(x,bins)

In [12]:
y

[(40.0, 60.0], (40.0, 60.0], (40.0, 60.0], (20.0, 40.0], NaN, NaN, (20.0, 40.0], (80.0, 100.0], (20.0, 40.0], (20.0, 40.0]]
Categories (4, interval[int64]): [(20, 40] < (40, 60] < (60, 80] < (80, 100]]

# Permutation and Random Sampling

Jaha combination and ordering ki bt hoti hai its means permutation

# Sample (mean partiall peace pr kaam karna chah rehe hote hain.)

# Computing Indicator/Dummy Variables

more than one values to observe one output screen

In [16]:
movies = [{
    'gerner':'Action',
    'ReleaseYear': 2019,
    'Name': '21 Brideges',
},
{
   'gerner':'Action',
    'ReleaseYear': 2020,
    'Name': '21 BlackWidow',   
},
{
   'gerner':'Action, Drama',
    'ReleaseYear': 2021,
    'Name': '21 Joker',   
},
{
   'gerner':'Animes',
    'ReleaseYear': 2022,
    'Name': '21 Frozen',   
}]

In [17]:
df = pd.DataFrame(movies)

In [18]:
df

            Name  ReleaseYear         gerner
0    21 Brideges         2019         Action
1  21 BlackWidow         2020         Action
2       21 Joker         2021  Action, Drama
3      21 Frozen         2022         Animes

In [19]:
dummy = pd.get_dummies(df['ReleaseYear'])

In [21]:
dummy

   2019  2020  2021  2022
0     1     0     0     0
1     0     1     0     0
2     0     0     1     0
3     0     0     0     1

In [22]:
df2 = df.join(dummy)

In [23]:
df2

            Name  ReleaseYear         gerner  2019  2020  2021  2022
0    21 Brideges         2019         Action     1     0     0     0
1  21 BlackWidow         2020         Action     0     1     0     0
2       21 Joker         2021  Action, Drama     0     0     1     0
3      21 Frozen         2022         Animes     0     0     0     1

# String Object Methods

split language break kar ke dal deta hai

In [29]:
c = '1.2.33.45.5555.6'
print(c.split('.'))#output same

['1', '2', '33', '45', '5555', '6']

# Regular Expressions